## [데이터 필터링]
- 원하는 데이터를 추출하기 위해서 사용하는 방법
- 원하는 데이터 걸러내겠다는 의미
- 다양한 조건 검사 진행 => 비교 검사 : 같다 ==, 같지 않다 !=, 크다 >, 크거나 같다 >=, 작다 <, 작거나 같다 <=

(1) 모듈 로딩 <hr>

In [2]:
import pandas as pd
import numpy as np

(2) 데이터 준비 <hr>

In [3]:
file = '../DATA/employees.csv'

(3) 데이터 저장 <hr>

In [4]:
empDF = pd.read_csv(file)

(4) 데이터 확인 <hr>

In [5]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [6]:
'Happy' == 'Happy', 'Happy' != 'happy'

(True, True)

- [문제] 데이터에서 이름이 Maria인 데이터만 추출

In [7]:
print(empDF.columns, empDF.index, sep='\n\n')

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

RangeIndex(start=0, stop=1001, step=1)

- bool 값으로 구성된 데이터 ==> 불린 인덱싱(Boolean Indexing)

In [8]:
mariaMask = empDF['First Name'] == 'Maria'
print(type(mariaMask), mariaMask.sum(), sep='\n\n')

<class 'pandas.core.series.Series'>

6

In [9]:
empDF[mariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

- [문제] employees 데이터에서 연봉이 50000이상인 데이터 추출

In [10]:
empDF['Salary'] >= 50000

0       False
1        True
2        True
3        True
4        True
        ...
996     False
997      True
998      True
999      True
1000    False
Name: Salary, Length: 1001, dtype: bool

In [11]:
empDF[empDF['Salary'] >= 140000]

    First Name  Gender Start Date    Salary   Mgmt          Team
36      Rachel  Female    2/16/09  142032.0  False  Business Dev
44     Cynthia  Female   11/16/88  145146.0   True       Product
83       Shawn    Male    9/23/05  148115.0   True       Finance
87       Annie  Female    1/30/93  144887.0   True         Sales
96     Cynthia  Female    3/21/94  142321.0  False       Finance
..         ...     ...        ...       ...    ...           ...
948     Ashley  Female    3/31/06  142410.0   True   Engineering
951        NaN  Female    9/14/10  143638.0    NaN           NaN
979     Ernest    Male    7/20/13  142935.0   True       Product
981      James    Male    1/15/93  148985.0  False         Legal
983       John    Male   12/23/82  146907.0  False   Engineering

[80 rows x 6 columns]

- [문제] employees 데이터에서 성별이 남자이며 연봉이 100000이상인 데이터 추출

In [12]:
(empDF['Gender'] == 'Male').head()

0     True
1     True
2    False
3    False
4     True
Name: Gender, dtype: bool

In [13]:
(empDF['Salary'] >= 100000).head()

0    False
1    False
2     True
3     True
4     True
Name: Salary, dtype: bool

- 여러 개의 조건이 모두 True여야만 하는 조건 => AND 조건
    * 문법 : 조건1 & 조건2 & 조건3 ... & 조건N
    * 연산자 : & 엠퍼샌드
    * 결과 : True/False

In [14]:
mask = (empDF['Gender'] == 'Male') & (empDF['Salary'] >= 148000)
type(mask), mask.sum()

(pandas.core.series.Series, 5)

In [15]:
empDF[mask]

    First Name Gender Start Date    Salary   Mgmt     Team
83       Shawn   Male    9/23/05  148115.0   True  Finance
318        Roy   Male     8/6/06  148225.0  False  Finance
800   Clarence   Male     8/5/89  148941.0  False  Product
850    Charles   Male     9/3/97  148291.0  False      NaN
981      James   Male    1/15/93  148985.0  False    Legal

In [19]:
empDF['Start Date'] = pd.to_datetime(empDF['Start Date'], format='%m/%d/%y')
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.0+ KB

- 여러 개의 조건 중 1개 이상이 True면 True가 되는 조건 => OR 조건
    * 문법 : 조건1 | 조건2 | 조건3 ... | 조건N
    * 연산자 : | 파이프 ==> 키보드 Enter키 위에 있음
    * 결과 : True/False

- [문제] employees 데이터에서 입사일이 1993년 1월 1일 이전이거나 또는 매니지먼트가 없는 사람 데이터 조회

In [17]:
dayMask = empDF['Start Date'] < '1993-01-01'
mgmtMask = empDF['Mgmt'] == False

In [18]:
empDF[dayMask | mariaMask]

    First Name  Gender Start Date    Salary   Mgmt       Team
2        Maria  Female        NaT  130590.0  False    Finance
5       Dennis    Male 1987-04-18  115163.0  False      Legal
6         Ruby  Female 1987-08-17   65476.0   True    Product
10      Louise  Female 1980-08-12   63241.0   True        NaN
12     Brandon    Male 1980-12-01  112807.0   True         HR
..         ...     ...        ...       ...    ...        ...
985    Stephen     NaN 1983-07-10   85668.0  False      Legal
986      Donna  Female 1982-11-26   82871.0  False  Marketing
989     Justin     NaN 1991-02-10   38344.0  False      Legal
990      Robin  Female 1987-07-24  100765.0   True         IT
996    Phillip    Male 1984-01-31   42392.0  False    Finance

[320 rows x 6 columns]

In [21]:
pd.to_datetime(empDF['Start Date'], format='%m/%d/%y')

0      1993-08-06
1      1996-03-31
2             NaT
3      2005-03-04
4      1998-01-24
          ...
996    1984-01-31
997    2013-05-20
998    2013-04-20
999    2012-05-15
1000          NaT
Name: Start Date, Length: 1001, dtype: datetime64[ns]

- 구간 지정 검사 불린 메서드 => DF.between(low, high)

In [22]:
(empDF['Salary'] >= 80000) & (empDF['Salary'] < 90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [23]:
empDF['Salary'].between(80000, 90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [28]:
empDF['First Name'].str.replace(r'[a-z]+', lambda m:m.group(0)[::-1], regex=True)

0       Dsalguo
1        Tsamoh
2         Maira
3         Jyrre
4         Lyrra
         ...
996     Ppillih
997     Rllessu
998       Lyrra
999      Atrebl
1000        NaN
Name: First Name, Length: 1001, dtype: object